#ifndef __AT24C02_H__
#define __AT24C02_H__
#include "iic.h"
#define AT24C02 0xA0		//从设备地址
/*******************************************************
函数:void AT24C02_Write(u8 addr,u8 *data,u8 len)
功能:IIC写入数据到AT24C02
参数:
	@addr:设备写入首内存地址
	@data:数据地址
	@len:数据长度
返回值:无
说明:
	如果循环发送数据,则产生停止信号,直到发完,则产生停止信号
	注意:理解像文件操作,有一个文件读写指针,会往后偏移
********************************************************/
void AT24C02_Write(u8 addr,u8 *data,u8 len);
/*******************************************************
函数:void AT24C02_Read(u8 addr,u8 *data,u8 len)
功能:IIC读取AT24C02数据
参数:
	@addr:设备读取首内存地址
	@data:数据地址
	@len:数据长度
返回值:
说明:随机读取
********************************************************/
void AT24C02_Read(u8 addr,u8 *data,u8 len);
#endif

